#Requires AutoHotkey v2.0-beta

SwitchLang(txt){
    en := ["q","w","e","r","t","y","u","i","o","p","[","]","a","s","d","f","g","h","j","k","l",";","'","z","x","c","v","b","n","m",",",".","/","`"]
    ar := ["ض", "ص", "ث", "ق", "ف", "غ", "ع", "ه", "خ", "ح", "ج", "د", "ش", "س", "ي", "ب", "ل", "ا", "ت", "ن", "م", "ك", "ط", "ئ", "ء", "ؤ", "ر", "لا", "ى", "ة", "و", "ز", "ظ", "ذ"]
    en_d := {"q": 1, "w": 2, "e": 3, "r": 4, "t": 5, "y": 6, "u": 7, "i": 8, "o": 9, "p": 10, "[": 11, "]": 12, "a": 13, "s": 14, "d": 15, "f": 16, "g": 17, "h": 18, "j": 19, "k": 20, "l": 21, ";": 22, "'": 23, "z": 24, "x": 25, "c": 26, "v": 27, "b": 28, "n": 29, "m": 30, ",": 31, ".": 32, "/": 33, "`": 34}
    ar_d := {"ض":1, "ص":2, "ث":3, "ق":4, "ف":5, "غ":6, "ع":7, "ه":8, "خ":9, "ح":10, "ج":11, "د":12, "ش":13, "س":14, "ي":15, "ب":16, "ل":17, "ا":18, "ت":19, "ن":20, "م":21, "ك":22, "ط":23, "ئ":24, "ء":25, "ؤ":26, "ر":27, "لا":28, "ى":29, "ة":30, "و":31, "ز":32, "ظ":33, "ذ":34}

    res := ""
    Loop, parse, txt,
    {
        ari := ar_d[A_LoopField]
        eni := en_d[A_LoopField]

        If (ari=="")
        {
            If (eni=="")
                res .= A_LoopField
            Else
                res .= ar[eni]
        }
        Else
            res .= en[ari]
    }
    Return res
}
^!+s::

    Send, {End}+{Home}
    oCB := ClipboardAll
    Send, ^c
    Sleep, .2
    Send, ^c
    ClipWait, 1
    
    s := SwitchLang(Clipboard)
    Send, %s%

    ClipBoard := oCB

Return